app/controllers/journals_controller.rb

  def index
    @journals = Journal.all
---
SELECT "journals".* FROM "journals"

  def create
    @journal = Journal.new(journal_params)
    respond_to do |format|
      if @journal.save
---
INSERT INTO "journals" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "new journal"], ["description", "its new journal"], ["user_id", 4], ["created_at", "2021-05-24 10:46:22.633369"], ["updated_at", "2021-05-24 10:46:22.633369"]]

  def update
    respond_to do |format|
      if @journal.update(journal_params)
---
UPDATE "journals" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "journals"."id" = ?  [["title", "new journal edited"], ["description", "its new journal edited "], ["updated_at", "2021-05-24 10:56:27.286281"], ["id", 12]]

  def destroy
    @journal.destroy
---
DELETE FROM "journals" WHERE "journals"."id" = ?  [["id", 12]]

    def set_journal
      @journal = Journal.find(params[:id])
---
SELECT  "journals".* FROM "journals" WHERE "journals"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]